comparedDBs/performance_test_scripts/pebblesdb_scripts/10B_Pebblesdb_read_performance/Pebbles10B_10B_val_128_mem64MB_zipf1.2_NOT_EXIST.log
PebblesDB:    version 1.17
Date:       Thu Nov  7 13:27:43 2024
CPU:        112 * Intel(R) Xeon(R) Platinum 8180 CPU @ 2.50GHz
CPUCache:   39424 KB
../../../pebblesdb/release/db_bench --db=/mnt/hotdb_test/pebbles10B/read_mem64_1.2 --num=100000000 --value_size=128 --batch_size=1000 --benchmarks=readrandom,stats --use_existing_db=true --Read_data_file=/home/jeff-wang/workloads/uniform_read_keys16_value128_1Thousand_noexists.csv --data_file=/home/jeff-wang/workloads/zipf1.2_keys10.0B.csv --logpath=/mnt/logs --bloom_bits=10 --log=1 --cache_size=8388608 --open_files=40000 --mem_log_file=/home/jeff-wang/WorkloadAnalysis/comparedDBs/performance_test_scripts/pebblesdb_scripts/10B_Pebblesdb_zipf_hot_removal/Pebblesdb_memory_64MiB_10B_key16_val128_zipf1.2.log --compression=0 --reads=1000 --stats_interval=10000000 --histogram=1 --write_buffer_size=1048576 --max_file_size=1048576 --print_wa=true 
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    100000000
RawSize:    13732.9 MB (estimated)
FileSize:   7629.4 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Recover Time : 18446744073709528309
InitializeFileLevelBloomFilter Time: 66985477
InitializeTableCacheFileMetaData Time: 68
PebblesDB Open Time: 67168457
Write buffer: 1024.00 KB
thread 0 (0 of 100000000 found)
readrandom   :      42.098 micros/op 23754 ops/sec; (0 of 100000000 found)
Microseconds per op:
Count: 1000 Average: 42.0650  StdDev: 1238.87
Min: 2  Median: 2.0000  Max: 39199
Percentiles: P50: 2.00 P75: 2.44 P99: 9.92 P99.9: 33000.00 P99.99: 39199.00
------------------------------------------------------
(       1,       2 ]      604  60.400%  60.400% ############
(       2,       3 ]      333  33.300%  93.700% #######
(       3,       4 ]        3   0.300%  94.000% 
(       4,       6 ]        1   0.100%  94.100% 
(       6,      10 ]       50   5.000%  99.100% #
(      10,      15 ]        4   0.400%  99.500% 
(      15,      22 ]        1   0.100%  99.600% 
(      22,      34 ]        2   0.200%  99.800% 
(      34,      51 ]        1   0.100%  99.900% 
(   33000,   50000 ]        1   0.100% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  2        2        2         0        0         0
  3        2        0         0        0         0
  4       11        8         0        0         0
  5       19       16         0        0         0
  6      346      877         0        0         0
WriteAmplification: -nan

-------------------------- Timer information ----------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 0 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 1 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 2 --------------------

-------------------------------------------------------------------
-------------------------- Individual static timer information 3 --------------------

-------------------------------------------------------------------
-------------------------- Cumulative static timer information --------------------

-------------------------------------------------------------------